<template>
  <div id="app">
    <Navigation/>
      <AppInner>
        <h2>ViBoard.me</h2>
        <p style="text-align: right;"><i>Здесь авторы зарабатывают, а зрители свободны от рекламы</i></p>

        <p>В 2014 основатели Reddit предположили, что площадка будет улучшена, если часть доходов будет возвращаться
          пользователям. Однако тогда эта схема не вызывала доверия из-за непрозрачности.  С приходом новых
          технологий такой подход стал реальностью.</p>

          <h4>Что это такое?</h4>
          <p>ViBoard.me  - это сайт, где зарабатывают на создании видеороликов,  комментировании и оценке.</p>

          <h4>Как это работает?</h4>

          <p>За любое действие на нашей платформе вы будете получать выплаты.  Как автор - за публикацию собственных видеороликов, как пользователь - за комментирование и оценивание постов.

          Пользователи оценивают контент авторов и  определяют какие видеоролики заслуживают внимание, а какие нет. Чем популярнее пост - тем больше получаете.

          С другой стороны, находя уникальный и интересный контент раньше остальных и выводя его в топ, то есть голосуя раньше остальных, пользователи также получают часть выплат.
          </p>
          <h4>Откуда берутся деньги?</h4>
          <p>
          Создавая пост, вы получаете выплату не в рублях или долларах, а во внутренней валюте системы, называемой Голос. В любой момент времени вы можете зафиксировать её и перевести в реальные деньги.
          </p>
          <h4>Откуда стоимость Голоса?</h4>
          <p>
          Эта валюта также торгуется на бирже, как и любая другая. Только наша валюта, основана на блокчейне и торгуется она на криптовалютной бирже. Её стоимость обеспечивается популярностью площадки и качеством контента.
          </p>
          <h4>А вы точно меня не обманываете?</h4>
          <p>
          На точно таком же принципе основаны проекты Steemit, SteepShot, golos.io, goldvoice.club и многие другие. Каждый день на Steemit загружается более 20 000 постов, которые суммарно получают около 50 000 долларов премий.

          Например, наш собственный пост заработал порядка 7$  :)
          </p>
          <h4>Как вывести деньги?</h4>
          <p>
          Пока что только через привязанный профиль на golos.io, но в скором будущем мы сделаем удобный вывод денег нажатием одной кнопки.
          </p>
          <h4>Зачем нужен рейтинг и на что он влияет?</h4>
          <p>
          Высокий рейтинг помогает выводить в топ видео, за которые вы голосуете -- это возможность продвинуть ваш канал. Размещайте видео, комментируйте и голосуйте, чтобы получить очки рейтинга.

          Вы можете отказаться от выплат за видео, и получить в два раза больше очков рейтинга.б
          </p>
          <h4>Чем мы лучше других?</h4>
          <p>
          Мы верим, что окупать создание творческого и уникального контент можно не только с помощью рекламы, а благодаря дружелюбному и демократическому сообществу.
          </p>
        </AppInner>
  </div>
</template>

<script>
  import Comments from './Comments.vue'
  import Upvotes from './Upvotes.vue'
  import {PlyrVideo} from 'vue-plyr'
  import {getVideoContent} from './getVideoContent.js'
  import {parseBody} from './parseBody.js'

  import AppInner from './AppInner.vue'
  import VideoBlock from './VideoBlock.vue'
  import Navigation from './Navigation.vue'
  import 'bootstrap/dist/css/bootstrap.css'
  import 'bootstrap-vue/dist/bootstrap-vue.css'
  import BootstrapVue from 'bootstrap-vue'
  import Vue from 'vue'

  Vue.use(BootstrapVue);

  export default {
    name: 'FAQ',

    components: {
      Comments,
      Upvotes,
      PlyrVideo,
      VideoBlock,
      Navigation,
      AppInner,
    },

    mixins: [parseBody, getVideoContent],

    data: function () {
      return {};
    },

    created: function() {
      document.title = 'FAQ';
    }
  }
</script>

<style>
  h2 {
    font-weight: bolder;
    margin-bottom: 0;
  }
  h4 {
    margin-bottom: 0;
    margin-top: 1.0em;
    font-weight: bolder;
  }
  p {
    margin-bottom: 10px;
  }
  i {

  }
</style>
